105 36 260
115 114 261
119 36 262
120 108 263
109 114 264
105 118 265
120 109 266
104 36 267
120 36 268
101 114 269
105 119 270
263 260 271
101 118 272
266 261 273
105 114 274
62 36 275
48 36 276
115 118 277
125 36 278
115 36 279
101 112 280
115 106 281
281 36 282
105 267 283
67 14 284
121 270 285
273 275 286
108 101 287
85 285 288
288 286 289
118 105 290
101 36 291
109 119 292
109 103 293
101 120 294
264 36 295
264 107 296
269 267 297
115 121 298
289 91 299
120 279 300
109 112 301
105 112 302
265 36 303
118 115 304
287 268 305
296 36 306
50 36 307
103 108 308
101 262 309
109 262 310
105 262 311
109 120 312
119 120 313
123 265 314
101 113 315
115 113 316
261 36 317
280 36 318
115 112 319
299 305 320
101 119 321
104 109 322
121 118 323
105 113 324
114 36 325
284 69 326
101 103 327
105 103 328
101 273 329
114 119 330
277 36 331
269 36 332
314 275 333
330 333 334
326 334 335
50 14 336
116 112 337
274 36 338
115 123 339
103 261 340
123 309 341
105 120 342
121 112 343
274 120 344
109 118 345
122 260 346
121 119 347
109 113 348
108 36 349
101 268 350
280 112 351
121 114 352
123 108 353
104 105 354
112 105 355
292 120 356
263 36 357
282 271 358
109 107 359
122 265 360
118 101 361
274 268 362
116 115 363
113 101 364
121 113 365
284 320 366
272 36 367
101 107 368
103 316 369
101 102 370
299 108 371
108 260 372
43 262 373
105 276 374
118 109 375
273 36 376
109 36 377
105 104 378
106 331 379
116 109 380
105 124 381
115 103 382
120 265 383
123 109 384
113 115 385
112 109 386
116 304 387
119 276 388
77 325 389
329 36 390
102 278 391
272 260 392
119 265 393
302 112 394
298 114 395
113 36 396
263 350 397
106 277 398
312 278 399
266 103 400
119 109 401
295 271 402
101 116 403
260 282 404
119 121 405
263 105 406
104 121 407
120 115 408
14 320 409
101 104 410
384 357 411
118 270 412
284 289 413
112 278 414
116 272 415
115 116 416
322 267 417
53 61 418
308 36 419
88 372 420
123 305 421
119 268 422
111 36 423
119 108 424
293 349 425
264 103 426
340 120 427
54 52 428
102 105 429
339 36 430
119 105 431
123 277 432
117 121 433
106 264 434
105 272 435
101 122 436
293 36 437
104 260 438
380 199 439
439 189 440
440 36 441
104 265 442
120 275 443
274 103 444
262 282 445
115 107 446
119 356 447
263 303 448
116 265 449
105 123 450
125 276 451
301 36 452
294 260 453
116 277 454
112 260 455
106 106 456
310 271 457
36 297 458
109 268 459
105 336 460
284 371 461
345 36 462
114 115 463
116 36 464
283 300 465
276 297 466
287 346 467
113 269 468
109 104 469
269 104 470
116 118 471
301 260 472
14 289 473
321 119 474
353 425 475
292 108 476
315 279 477
101 264 478
262 297 479
314 260 480
120 274 481
105 107 482
104 101 483
106 304 484
121 120 485
272 278 486
105 122 487
112 267 488
270 120 489
328 120 490
112 115 491
118 274 492
106 293 493
118 269 494
122 109 495
112 36 496
484 396 497
108 310 498
270 268 499
447 269 500
355 107 501
407 103 502
272 104 503
119 500 504
261 107 505
102 112 506
290 103 507
116 105 508
313 118 509
504 443 510
283 391 511
406 462 512
351 278 513
119 307 514
104 292 515
107 109 516
287 262 517
468 278 518
103 115 519
276 271 520
266 346 521
105 116 522
102 115 523
351 36 524
121 104 525
89 393 526
526 275 527
71 108 528
341 271 529
123 105 530
104 279 531
294 283 532
277 260 533
290 112 534
266 122 535
263 265 536
292 349 537
394 36 538
120 303 539
316 260 540
272 107 541
269 107 542
106 327 543
343 120 544
105 367 545
324 337 546
109 126 547
283 271 548
102 260 549
106 36 550
101 125 551
76 430 552
293 318 553
398 113 554
120 361 555
102 121 556
118 298 557
101 106 558
109 342 559
283 295 560
298 488 561
300 271 562
427 304 563
298 118 564
87 120 565
272 105 566
14 371 567
52 52 568
119 260 569
290 122 570
304 123 571
266 113 572
121 325 573
112 112 574
116 108 575
71 261 576
115 448 577
298 268 578
103 344 579
291 113 580
294 311 581
107 274 582
261 260 583
115 102 584
312 262 585
107 115 586
270 276 587
450 36 588
463 268 589
113 352 590
298 262 591
121 103 592
120 262 593
315 260 594
103 319 595
277 278 596
395 120 597
113 264 598
89 114 599
118 292 600
105 335 601
119 302 602
113 362 603
287 267 604
63 36 605
263 310 606
269 268 607
324 102 608
53 60 609
14 14 610
342 300 611
125 545 612
112 101 613
265 118 614
113 105 615
111 260 616
119 116 617
103 317 618
120 381 619
116 121 620
376 282 621
36 282 622
119 546 623
623 293 624
69 510 625
261 104 626
109 311 627
102 328 628
120 101 629
274 104 630
119 125 631
119 279 632
308 115 633
116 343 634
563 574 635
428 52 636
120 317 637
106 345 638
370 301 639
428 53 640
424 109 641
359 108 642
336 320 643
113 265 644
307 69 645
272 266 646
112 382 647
113 533 648
429 338 649
505 36 650
114 329 651
52 36 652
116 474 653
266 120 654
339 325 655
272 267 656
387 107 657
120 105 658
369 116 659
109 493 660
321 268 661
115 337 662
109 266 663
108 105 664
471 348 665
353 279 666
323 260 667
264 120 668
103 260 669
115 276 670
301 104 671
38 36 672
104 303 673
638 422 674
395 267 675
508 662 676
306 271 677
109 354 678
104 115 679
302 278 680
265 260 681
77 114 682
107 557 683
317 271 684
118 348 685
492 442 686
45 36 687
262 392 688
308 272 689
270 260 690
633 319 691
113 344 692
264 383 693
103 597 694
290 260 695
413 389 696
302 36 697
109 332 698
363 634 699
359 386 700
700 277 701
80 626 702
301 112 703
125 435 704
120 123 705
69 118 706
432 111 707
454 120 708
298 119 709
364 295 710
365 36 711
360 114 712
313 324 713
109 291 714
105 49 715
112 436 716
69 112 717
260 452 718
336 625 719
120 125 720
354 434 721
113 347 722
348 590 723
263 332 724
294 481 725
417 271 726
116 412 727
307 88 728
313 294 729
327 111 730
104 316 731
461 279 732
272 460 733
319 446 734
121 290 735
387 502 736
118 293 737
312 125 738
576 619 739
739 443 740
444 260 741
400 36 742
409 457 743
344 262 744
101 419 745
101 456 746
389 102 747
393 346 748
291 686 749
426 112 750
266 36 751
260 264 752
353 338 753
105 106 754
552 518 755
426 260 756
586 712 757
114 105 758
307 84 759
107 112 760
747 570 761
761 374 762
748 749 763
763 718 764
764 657 765
765 611 766
766 441 767
767 635 768
768 639 769
769 374 770
770 441 771
771 501 772
772 516 773
773 102 774
774 472 775
775 260 776
776 441 777
777 543 778
778 472 779
779 104 780
780 580 781
781 701 782
782 733 783
555 264 784
509 592 785
87 298 786
102 342 787
530 338 788
336 289 789
108 109 790
106 118 791
109 122 792
116 261 793
705 279 794
369 337 795
105 125 796
340 103 797
379 271 798
230 132 799
405 116 800
101 278 801
113 272 802
653 368 803
679 311 804
347 260 805
631 713 806
109 318 807
295 418 808
113 332 809
280 632 810
323 306 811
107 571 812
784 306 813
624 460 814
121 262 815
720 116 816
343 367 817
787 788 818
360 119 819
307 420 820
103 394 821
339 303 822
105 360 823
270 262 824
115 104 825
103 290 826
377 295 827
292 268 828
301 278 829
385 104 830
370 455 831
327 383 832
109 261 833
107 121 834
272 113 835
76 272 836
329 262 837
109 101 838
388 297 839
283 291 840
710 678 841
841 291 842
842 358 843
843 803 844
307 389 845
364 438 846
461 338 847
277 107 848
101 263 849
120 261 850
119 328 851
103 112 852
106 105 853
294 279 854
573 120 855
69 644 856
856 293 857
103 375 858
363 119 859
844 601 860
103 332 861
115 120 862
312 283 863
265 262 864
116 290 865
102 302 866
73 114 867
103 321 868
308 328 869
104 262 870
104 294 871
112 470 872
107 108 873
105 268 874
354 122 875
119 335 876
103 399 877
683 116 878
260 360 879
879 660 880
87 36 881
71 265 882
43 584 883
883 559 884
884 535 885
885 670 886
377 483 887
558 539 888
307 87 889
102 323 890
104 270 891
364 110 892
101 267 893
114 365 894
121 116 895
340 106 896
359 114 897
319 112 898
411 271 899
36 102 900
264 260 901
882 408 902
902 759 903
903 646 904
904 477 905
905 104 906
906 351 907
907 886 908
908 363 909
909 377 910
910 834 911
911 272 912
912 322 913
913 477 914
914 887 915
915 751 916
916 752 917
917 434 918
918 880 919
919 790 920
920 477 921
921 452 922
922 600 923
923 544 924
924 854 925
925 618 926
926 855 927
927 499 928
928 814 929
323 118 930
307 77 931
115 125 932
121 464 933
311 282 934
111 114 935
118 278 936
270 119 937
307 70 938
268 282 939
405 419 940
361 322 941
869 111 942
363 668 943
115 267 944
291 119 945
432 267 946
322 36 947
696 421 948
311 297 949
534 359 950
313 525 951
108 302 952
104 356 953
312 260 954
101 308 955
104 306 956
307 76 957
264 300 958
385 422 959
283 379 960
620 506 961
102 265 962
120 323 963
109 591 964
598 356 965
120 338 966
107 349 967
407 260 968
301 496 969
280 262 970
602 106 971
101 111 972
120 352 973
121 318 974
329 276 975
719 762 976
114 315 977
84 118 978
393 122 979
689 832 980
556 671 981
108 115 982
79 614 983
72 105 984
91 108 985
105 456 986
336 371 987
119 540 988
120 280 989
111 105 990
123 561 991
112 541 992
116 269 993
971 49 994
274 119 995
294 482 996
478 120 997
119 103 998
313 262 999
118 315 1000
266 119 1001
82 588 1002
310 291 1003
368 260 1004
102 290 1005
408 111 1006
315 116 1007
269 103 1008
113 261 1009
370 578 1010
101 109 1011
319 121 1012
336 14 1013
386 315 1014
103 351 1015
260 295 1016
354 116 1017
113 109 1018
326 510 1019
386 616 1020
199 173 1021
406 278 1022
109 102 1023
119 366 1024
119 348 1025
290 321 1026
121 102 1027
109 317 1028
322 273 1029
103 101 1030
306 282 1031
264 106 1032
262 295 1033
617 328 1034
308 323 1035
290 355 1036
119 691 1037
412 793 1038
116 319 1039
278 282 1040
276 475 1041
125 335 1042
725 376 1043
567 279 1044
107 290 1045
87 125 1046
75 274 1047
348 708 1048
515 103 1049
81 264 1050
53 36 1051
294 120 1052
743 860 1053
262 271 1054
108 303 1055
642 268 1056
867 760 1057
112 542 1058
1058 121 1059
55 36 1060
390 282 1061
434 715 1062
1062 973 1063
101 521 1064
347 465 1065
122 280 1066
120 494 1067
1067 119 1068
74 492 1069
106 315 1070
401 261 1071
294 306 1072
875 302 1073
1073 416 1074
337 269 1075
70 375 1076
261 49 1077
109 819 1078
853 294 1079
71 319 1080
69 114 1081
119 372 1082
528 264 1083
101 123 1084
337 327 1085
57 36 1086
391 271 1087
290 106 1088
368 478 1089
313 453 1090
104 328 1091
340 119 1092
59 36 1093
940 309 1094
101 301 1095
935 655 1096
750 525 1097
106 109 1098
87 380 1099
1099 482 1100
104 811 1101
355 367 1102
399 297 1103
309 271 1104
122 272 1105
120 118 1106
399 282 1107
641 464 1108
287 120 1109
113 608 1110
102 345 1111
702 317 1112
424 561 1113
280 102 1114
345 364 1115
327 376 1116
541 365 1117
723 260 1118
87 315 1119
1119 115 1120
354 104 1121
352 673 1122
112 264 1123
651 318 1124
281 493 1125
961 476 1126
483 278 1127
931 268 1128
335 271 1129
608 303 1130
384 263 1131
43 268 1132
112 125 1133
309 291 1134
112 348 1135
274 266 1136
105 745 1137
272 120 1138
265 318 1139
385 531 1140
265 276 1141
429 107 1142
102 303 1143
74 494 1144
401 102 1145
101 276 1146
122 292 1147
114 450 1148
721 109 1149
796 114 1150
70 403 1151
1151 266 1152
69 36 1153
1036 321 1154
86 109 1155
114 588 1156
43 36 1157
70 272 1158
69 71 1159
339 114 1160
324 344 1161
522 120 1162
641 116 1163
397 271 1164
48 568 1165
298 120 1166
1089 422 1167
112 294 1168
273 262 1169
665 260 1170
1170 965 1171
119 317 1172
327 423 1173
327 120 1174
556 268 1175
1017 630 1176
78 450 1177
304 116 1178
264 322 1179
497 271 1180
125 263 1181
112 446 1182
511 271 1183
461 425 1184
456 265 1185
994 1043 1186
369 113 1187
123 538 1188
281 106 1189
104 283 1190
356 277 1191
114 1077 1192
385 122 1193
264 104 1194
352 103 1195
74 1150 1196
1035 308 1197
300 549 1198
109 105 1199
292 396 1200
74 315 1201
107 315 1202
1019 929 1203
474 365 1204
261 373 1205
382 559 1206
948 612 1207
429 306 1208
746 1115 1209
1209 521 1210
572 260 1211
111 262 1212
268 1159 1213
408 279 1214
280 260 1215
415 120 1216
359 349 1217
277 105 1218
264 105 1219
116 822 1220
290 107 1221
454 268 1222
1048 607 1223
102 304 1224
676 260 1225
757 603 1226
364 278 1227
473 389 1228
281 966 1229
599 863 1230
298 967 1231
465 271 1232
116 375 1233
491 119 1234
615 269 1235
87 993 1236
848 269 1237
413 755 1238
101 313 1239
857 332 1240
699 390 1241
942 943 1242
108 503 1243
120 489 1244
579 323 1245
107 36 1246
269 669 1247
308 542 1248
343 268 1249
350 271 1250
426 1026 1251
950 964 1252
312 451 1253
272 114 1254
312 311 1255
106 898 1256
81 272 1257
274 267 1258
1196 809 1259
119 281 1260
84 108 1261
1155 1204 1262
791 321 1263
816 404 1264
566 291 1265
490 283 1266
105 109 1267
105 321 1268
519 438 1269
125 373 1270
262 402 1271
547 283 1272
77 36 1273
343 36 1274
115 122 1275
386 122 1276
284 420 1277
363 401 1278
515 119 1279
276 290 1280
602 550 1281
276 421 1282
628 594 1283
269 120 1284
263 695 1285
106 695 1286
112 104 1287
332 73 1288
294 680 1289
293 260 1290
446 114 1291
370 112 1292
73 121 1293
783 14 1294
682 322 1295
647 318 1296
871 291 1297
340 447 1298
264 114 1299
1069 419 1300
77 989 1301
106 115 1302
347 283 1303
401 317 1304
103 403 1305
260 433 1306
269 109 1307
71 316 1308
269 278 1309
108 280 1310
366 457 1311
104 382 1312
1261 301 1313
103 538 1314
527 1262 1315
1315 827 1316
1316 968 1317
1317 1263 1318
1318 377 1319
1319 452 1320
1320 797 1321
1321 611 1322
1322 947 1323
1206 278 1324
101 462 1325
1080 501 1326
304 119 1327
121 260 1328
1210 1116 1329
1037 36 1330
70 118 1331
87 691 1332
113 102 1333
1118 806 1334
80 36 1335
1213 36 1336
119 112 1337
269 262 1338
115 108 1339
274 107 1340
117 285 1341
104 324 1342
69 121 1343
108 709 1344
415 1014 1345
442 325 1346
287 116 1347
114 594 1348
119 756 1349
115 119 1350
383 396 1351
266 496 1352
91 277 1353
91 367 1354
101 295 1355
115 569 1356
382 103 1357
595 112 1358
102 321 1359
69 103 1360
395 104 1361
527 1100 1362
1362 315 1363
1363 827 1364
1364 1140 1365
1365 624 1366
1366 260 1367
308 114 1368
81 36 1369
103 1102 1370
113 524 1371
795 381 1372
894 1143 1373
101 121 1374
650 411 1375
120 260 1376
1076 1001 1377
1377 349 1378
112 324 1379
980 292 1380
105 263 1381
114 293 1382
555 1029 1383
71 269 1384
107 361 1385
315 36 1386
722 437 1387
82 277 1388
599 1078 1389
786 263 1390
1006 274 1391
119 266 1392
125 119 1393
123 1109 1394
410 302 1395
292 113 1396
105 792 1397
199 172 1398
279 119 1399
364 308 1400
981 296 1401
45 276 1402
283 402 1403
528 272 1404
264 122 1405
1049 685 1406
1406 264 1407
413 552 1408
405 102 1409
354 102 1410
731 270 1411
435 414 1412
290 120 1413
704 262 1414
84 319 1415
278 81 1416
640 56 1417
378 276 1418
983 278 1419
111 264 1420
111 306 1421
319 264 1422
283 317 1423
823 278 1424
892 331 1425
292 405 1426
799 151 1427
321 108 1428
103 561 1429
104 261 1430
120 290 1431
107 105 1432
431 415 1433
804 271 1434
303 297 1435
385 1346 1436
79 296 1437
413 420 1438
523 104 1439
105 464 1440
892 277 1441
271 86 1442
353 472 1443
261 267 1444
996 596 1445
121 438 1446
101 805 1447
370 355 1448
1023 355 1449
645 36 1450
507 277 1451
347 311 1452
985 338 1453
1068 554 1454
401 442 1455
368 311 1456
1301 698 1457
1025 301 1458
322 1185 1459
38 458 1460
113 342 1461
323 1307 1462
1462 711 1463
327 268 1464
728 498 1465
102 564 1466
109 444 1467
309 1188 1468
361 107 1469
86 293 1470
108 656 1471
91 301 1472
293 120 1473
108 1191 1474
272 675 1475
802 375 1476
269 266 1477
467 649 1478
262 44 1479
112 121 1480
398 260 1481
324 277 1482
115 423 1483
263 324 1484
1313 1395 1485
1485 575 1486
82 73 1487
264 313 1488
291 618 1489
1400 901 1490
355 1254 1491
519 120 1492
1390 1007 1493
75 105 1494
382 109 1495
112 650 1496
112 370 1497
1411 400 1498
87 997 1499
1158 263 1500
868 264 1501
565 453 1502
103 277 1503
108 430 1504
628 540 1505
115 360 1506
261 276 1507
270 383 1508
387 103 1509
360 278 1510
1165 652 1511
469 362 1512
451 297 1513
120 283 1514
101 373 1515
629 616 1516
108 298 1517
105 366 1518
1012 273 1519
300 290 1520
324 454 1521
280 121 1522
78 343 1523
368 404 1524
71 272 1525
261 414 1526
352 1352 1527
264 1176 1528
52 60 1529
301 386 1530
101 345 1531
375 311 1532
278 297 1533
1292 476 1534
567 338 1535
296 276 1536
337 551 1537
750 1446 1538
1230 565 1539
294 270 1540
361 106 1541
109 1350 1542
1050 109 1543
1543 80 1544
1544 80 1545
268 310 1546
119 558 1547
1243 123 1548
1298 362 1549
357 1245 1550
978 426 1551
340 1455 1552
534 329 1553
263 1356 1554
114 260 1555
283 297 1556
283 411 1557
329 318 1558
45 458 1559
120 112 1560
312 318 1561
583 358 1562
109 400 1563
53 52 1564
353 681 1565
102 118 1566
75 290 1567
473 420 1568
108 265 1569
363 264 1570
1570 268 1571
449 103 1572
527 85 1573
1573 974 1574
1574 1398 1575
1575 36 1576
1576 573 1577
1577 614 1578
1578 533 1579
1579 369 1580
1580 352 1581
1581 1306 1582
1582 470 1583
1583 1399 1584
1584 377 1585
1585 716 1586
1586 277 1587
1587 1489 1588
1490 1491 1589
1589 296 1590
405 36 1591
323 318 1592
119 111 1593
431 321 1594
307 81 1595
1114 711 1596
106 835 1597
1145 455 1598
507 1397 1599
1494 848 1600
1600 260 1601
398 103 1602
676 404 1603
102 361 1604
112 293 1605
1499 49 1606
1021 1379 1607
73 850 1608
74 1335 1609
82 342 1610
1224 410 1611
72 538 1612
546 932 1613
339 823 1614
1614 276 1615
106 675 1616
108 1217 1617
403 387 1618
296 262 1619
87 328 1620
269 577 1621
383 113 1622
627 282 1623
987 279 1624
119 409 1625
267 282 1626
328 535 1627
523 357 1628
374 297 1629
800 1222 1630
1275 303 1631
473 755 1632
61 36 1633
369 590 1634
858 116 1635
119 274 1636
347 401 1637
324 362 1638
337 293 1639
122 274 1640
307 83 1641
395 103 1642
116 303 1643
270 409 1644
262 300 1645
121 513 1646
319 122 1647
1437 731 1648
315 337 1649
107 494 1650
1236 537 1651
536 260 1652
313 581 1653
1288 113 1654
380 290 1655
307 72 1656
507 1291 1657
1177 537 1658
527 71 1659
1063 306 1660
375 102 1661
277 359 1662
1662 264 1663
41 622 1664
1368 553 1665
990 1440 1666
260 317 1667
586 944 1668
348 337 1669
359 323 1670
388 119 1671
1066 469 1672
429 287 1673
1673 495 1674
392 648 1675
435 1133 1676
536 872 1677
111 296 1678
1293 304 1679
1679 508 1680
86 316 1681
105 284 1682
1458 367 1683
311 392 1684
295 291 1685
717 1375 1686
82 1558 1687
294 277 1688
418 57 1689
564 36 1690
262 480 1691
81 302 1692
1692 1466 1693
1074 603 1694
786 357 1695
121 105 1696
992 499 1697
1380 400 1698
628 1447 1699
76 105 1700
308 671 1701
487 303 1702
1018 124 1703
263 557 1704
60 36 1705
121 873 1706
88 108 1707
1484 36 1708
1468 309 1709
516 122 1710
683 464 1711
119 316 1712
291 297 1713
454 593 1714
103 265 1715
113 377 1716
1716 573 1717
114 277 1718
953 737 1719
80 109 1720
1256 339 1721
90 345 1722
87 296 1723
313 265 1724
338 300 1725
659 995 1726
353 1255 1727
70 115 1728
70 93 1729
272 829 1730
836 456 1731
81 347 1732
1604 295 1733
418 56 1734
1606 1500 1735
410 1249 1736
418 58 1737
1260 1336 1738
71 70 1739
654 817 1740
71 1027 1741
433 101 1742
1742 452 1743
113 121 1744
106 539 1745
427 264 1746
101 126 1747
308 319 1748
1748 272 1749
449 109 1750
416 265 1751
354 493 1752
105 278 1753
416 36 1754
1011 267 1755
110 347 1756
307 74 1757
1046 375 1758
415 400 1759
403 116 1760
107 118 1761
119 296 1762
88 498 1763
104 489 1764
356 303 1765
432 423 1766
992 260 1767
293 111 1768
757 692 1769
490 277 1770
664 893 1771
433 345 1772
324 116 1773
566 321 1774
654 121 1775
54 36 1776
101 346 1777
491 422 1778
381 116 1779
311 271 1780
119 897 1781
1057 537 1782
432 1287 1783
1530 317 1784
514 420 1785
1353 488 1786
489 1534 1787
121 506 1788
119 643 1789
378 366 1790
114 697 1791
103 287 1792
291 81 1793
378 335 1794
272 268 1795
646 999 1796
471 327 1797
1797 400 1798
699 329 1799
88 105 1800
1800 1665 1801
1801 463 1802
1802 658 1803
1803 275 1804
1545 1369 1805
1805 606 1806
1806 797 1807
1807 522 1808
1808 1546 1809
1809 1065 1810
1810 1666 1811
1811 1296 1812
1812 813 1813
1813 615 1814
1814 321 1815
1815 323 1816
1816 1448 1817
1817 1280 1818
1818 736 1819
1819 1449 1820
1820 466 1821
1821 1547 1822
1822 1667 1823
1823 1092 1824
1824 365 1825
1825 303 1826
1826 1548 1827
1827 566 1828
1828 1450 1829
1829 1668 1830
1830 1669 1831
1831 1161 1832
1832 390 1833
1833 1451 1834
1834 870 1835
1835 896 1836
1836 1670 1837
1837 975 1838
1838 1452 1839
1839 1370 1840
1840 1182 1841
1841 1671 1842
1842 436 1843
1843 311 1844
1844 1242 1845
1845 839 1846
1846 1672 1847
1847 581 1848
1848 1674 1849
1849 331 1850
1850 411 1851
1851 1244 1852
1852 514 1853
1853 1453 1854
1854 813 1855
1855 945 1856
1856 1371 1857
1857 1454 1858
1858 1141 1859
1859 1297 1860
1860 433 1861
1861 280 1862
1862 1103 1863
1863 1549 1864
1864 487 1865
1865 1522 1866
1866 390 1867
1867 1675 1868
1868 1223 1869
1869 724 1870
1870 410 1871
1871 956 1872
1872 1372 1873
1873 399 1874
1874 1214 1875
1875 1676 1876
1876 1013 1877
82 105 1878
53 58 1879
1122 271 1880
270 335 1881
415 268 1882
115 536 1883
1459 362 1884
1460 38 1885
481 119 1886
270 366 1887
682 785 1888
1888 286 1889
613 126 1890
264 407 1891
1187 317 1892
361 575 1893
1174 331 1894
851 1444 1895
556 301 1896
113 292 1897
112 297 1898
298 1469 1899
1098 302 1900
306 295 1901
319 267 1902
280 263 1903
261 316 1904
123 969 1905
1189 119 1906
1906 471 1907
866 109 1908
105 423 1909
386 106 1910
344 276 1911
648 724 1912
1391 547 1913
830 302 1914
110 490 1915
575 1393 1916
56 36 1917
1063 296 1918
495 407 1919
107 295 1920
53 59 1921
264 486 1922
1388 357 1923
1079 323 1924
527 1201 1925
1925 1717 1926
1926 270 1927
1927 324 1928
1928 380 1929
1929 279 1930
1930 116 1931
1931 361 1932
1932 400 1933
1933 279 1934
1934 1591 1935
272 308 1936
962 268 1937
86 932 1938
123 272 1939
981 306 1940
449 579 1941
77 104 1942
1942 319 1943
123 1299 1944
89 881 1945
517 649 1946
564 103 1947
1148 617 1948
1948 403 1949
664 410 1950
298 873 1951
398 396 1952
1199 346 1953
1117 362 1954
1729 89 1955
103 930 1956
789 389 1957
732 341 1958
651 280 1959
76 435 1960
60 1529 1961
280 446 1962
201 136 1963
107 444 1964
103 491 1965
612 417 1966
1404 112 1967
1967 489 1968
1603 595 1969
119 716 1970
90 270 1971
1735 1607 1972
383 118 1973
103 524 1974
91 294 1975
523 503 1976
515 1268 1977
978 756 1978
554 350 1979
941 279 1980
313 837 1981
1334 36 1982
723 734 1983
70 323 1984
1083 690 1985
599 293 1986
1986 115 1987
1047 1139 1988
1988 71 1989
81 280 1990
103 661 1991
503 264 1992
502 1212 1993
983 1270 1994
957 1615 1995
1746 121 1996
119 323 1997
78 1339 1998
1085 260 1999
119 473 2000
891 858 2001
1420 1626 2002
277 442 2003
84 272 2004
119 1755 2005
272 414 2006
754 1274 2007
260 310 2008
401 346 2009
108 365 2010
55 52 2011
694 936 2012
87 1162 2013
2013 1130 2014
84 412 2015
101 360 2016
308 324 2017
2017 553 2018
106 343 2019
306 300 2020
87 265 2021
327 103 2022
337 332 2023
302 348 2024
2024 264 2025
113 469 2026
328 268 2027
312 1281 2028
729 105 2029
1521 486 2030
1125 807 2031
374 271 2032
364 616 2033
418 54 2034
73 124 2035
263 338 2036
319 260 2037
1343 509 2038
2038 280 2039
104 655 2040
1283 271 2041
87 716 2042
1654 1655 2043
1237 547 2044
86 522 2045
295 609 2046
567 681 2047
283 264 2048
116 997 2049
111 342 2050
1295 332 2051
120 479 2052
544 735 2053
84 1181 2054
327 535 2055
36 358 2056
1878 1677 2057
282 291 2058
125 366 2059
113 485 2060
487 338 2061
381 481 2062
1781 660 2063
119 594 2064
1891 509 2065
112 311 2066
506 730 2067
463 120 2068
53 652 2069
381 449 2070
316 36 2071
444 1899 2072
979 293 2073
276 295 2074
1305 1561 2075
808 52 2076
348 36 2077
1149 621 2078
1381 1382 2079
1149 273 2080
113 294 2081
118 318 2082
357 297 2083
1508 325 2084
406 596 2085
416 793 2086
347 511 2087
1918 976 2088
2088 1660 2089
369 415 2090
101 485 2091
1179 1919 2092
87 108 2093
122 345 2094
293 513 2095
1486 714 2096
347 404 2097
72 82 2098
408 1432 2099
582 105 2100
830 697 2101
642 120 2102
514 389 2103
665 486 2104
114 328 2105
1070 591 2106
87 1324 2107
294 667 2108
262 317 2109
1493 637 2110
544 667 2111
115 124 2112
785 120 2113
123 304 2114
1720 360 2115
355 124 2116
102 318 2117
1726 390 2118
2118 1117 2119
102 274 2120
685 108 2121
665 1730 2122
1039 1563 2123
381 328 2124
427 478 2125
722 293 2126
984 550 2127
1000 113 2128
1126 283 2129
313 470 2130
996 277 2131
260 512 2132
579 265 2133
108 125 2134
436 359 2135
1333 1542 2136
1059 1004 2137
1492 637 2138
366 1941 2139
2139 1524 2140
80 294 2141
103 305 2142
2142 385 2143
382 1678 2144
2144 1111 2145
1975 308 2146
106 101 2147
115 111 2148
73 637 2149
276 73 2150
446 1893 2151
106 1195 2152
74 378 2153
70 538 2154
1973 277 2155
2155 828 2156
1984 113 2157
1002 78 2158
2158 265 2159
2159 431 2160
116 312 2161
571 393 2162
1611 1991 2163
1006 338 2164
1992 970 2165
1741 1200 2166
105 307 2167
116 661 2168
109 280 2169
106 290 2170
53 57 2171
361 292 2172
1427 36 2173
291 290 2174
403 261 2175
105 111 2176
104 302 2177
114 1132 2178
86 1637 2179
451 271 2180
71 1642 2181
403 508 2182
416 1278 2183
1345 344 2184
390 358 2185
1171 303 2186
620 268 2187
427 2030 2188
517 271 2189
381 1649 2190
435 386 2191
2191 303 2192
865 495 2193
409 529 2194
109 550 2195
120 276 2196
654 455 2197
605 271 2198
643 457 2199
2021 102 2200
345 260 2201
560 418 2202
104 342 2203
1786 1354 2204
101 535 2205
311 358 2206
694 1532 2207
116 849 2208
2045 1788 2209
80 105 2210
335 291 2211
576 120 2212
363 120 2213
122 344 2214
847 417 2215
415 939 2216
283 421 2217
71 597 2218
567 425 2219
1070 829 2220
795 342 2221
311 300 2222
119 277 2223
114 279 2224
291 1186 2225
119 261 2226
364 1421 2227
861 549 2228
816 934 2229
311 480 2230
331 282 2231
348 387 2232
324 744 2233
487 344 2234
582 265 2235
1221 343 2236
1357 323 2237
566 309 2238
1039 293 2239
294 303 2240
571 325 2241
595 261 2242
459 341 2243
1472 1014 2244
323 677 2245
469 274 2246
445 291 2247
2080 445 2248
118 301 2249
125 112 2250
120 329 2251
1384 101 2252
1701 492 2253
1703 283 2254
957 260 2255
114 101 2256
728 108 2257
385 536 2258
1385 407 2259
429 1481 2260
852 474 2261
1389 399 2262
406 277 2263
1110 494 2264
1152 422 2265
1312 1106 2266
528 600 2267
1197 270 2268
87 540 2269
2098 1153 2270
2099 448 2271
453 271 2272
337 260 2273
821 262 2274
121 111 2275
14 420 2276
1487 881 2277
1504 518 2278
791 261 2279
629 295 2280
1936 312 2281
2281 490 2282
702 261 2283
717 1937 2284
1938 318 2285
364 264 2286
392 271 2287
106 491 2288
106 367 2289
1240 1943 2290
80 101 2291
71 290 2292
119 505 2293
1114 365 2294
636 55 2295
1348 358 2296
119 284 2297
109 362 2298
76 348 2299
2299 955 2300
483 829 2301
70 78 2302
2302 84 2303
268 300 2304
986 293 2305
102 375 2306
1267 448 2307
108 435 2308
274 126 2309
2114 1376 2310
263 690 2311
114 265 2312
459 310 2313
344 414 2314
2120 754 2315
1622 445 2316
387 449 2317
272 496 2318
487 1519 2319
458 75 2320
2320 930 2321
50 38 2322
376 297 2323
102 359 2324
416 815 2325
294 1962 2326
265 741 2327
79 584 2328
2328 125 2329
2329 613 2330
2330 1963 2331
2331 1593 2332
118 125 2333
123 551 2334
1142 295 2335
1233 122 2336
2336 453 2337
631 2136 2338
328 1904 2339
1525 1422 2340
1286 1969 2341
1760 435 2342
123 101 2343
71 399 2344
74 69 2345
1650 343 2346
2346 316 2347
287 107 2348
125 120 2349
813 647 2350
871 321 2351
115 377 2352
1207 417 2353
1551 824 2354
294 394 2355
644 103 2356
1732 1135 2357
896 1605 2358
706 113 2359
1989 1445 2360
1990 551 2361
69 1560 2362
2362 269 2363
2363 742 2364
1265 1269 2365
2161 419 2366
102 900 2367
1610 707 2368
1974 2133 2369
1120 291 2370
433 1095 2371
78 403 2372
2372 269 2373
308 276 2374
50 672 2375
112 822 2376
1613 105 2377
645 1745 2378
106 436 2379
53 53 2380
102 476 2381
1756 268 2382
283 350 2383
369 260 2384
800 708 2385
265 114 2386
894 962 2387
119 801 2388
2015 1512 2389
280 49 2390
963 325 2391
2018 530 2392
2392 2175 2393
114 381 2394
530 2176 2395
327 694 2396
121 268 2397
802 423 2398
1050 1765 2399
1639 390 2400
110 115 2401
114 306 2402
87 307 2403
1052 730 2404
1345 362 2405
1517 569 2406
388 271 2407
550 271 2408
308 541 2409
1171 265 2410
104 315 2411
297 291 2412
290 1341 2413
353 265 2414
102 1173 2415
118 260 2416
1775 376 2417
987 338 2418
278 271 2419
280 383 2420
2420 114 2421
2039 838 2422
284 389 2423
77 119 2424
310 589 2425
81 261 2426
1528 741 2427
112 272 2428
124 348 2429
2429 1289 2430
113 1784 2431
104 274 2432
122 115 2433
2203 265 2434
2434 598 2435
633 119 2436
826 453 2437
1294 740 2438
356 262 2439
365 344 2440
365 362 2441
1179 582 2442
272 122 2443
82 1064 2444
311 295 2445
277 673 2446
636 59 2447
1535 341 2448
107 941 2449
659 485 2450
116 507 2451
802 111 2452
113 327 2453
727 362 2454
266 311 2455
352 442 2456
301 399 2457
432 870 2458
1105 964 2459
1553 1163 2460
432 104 2461
436 115 2462
734 553 2463
310 1683 2464
2063 607 2465
388 421 2466
107 1890 2467
394 339 2468
941 711 2469
2068 831 2470
101 423 2471
294 596 2472
274 114 2473
647 532 2474
428 36 2475
322 1147 2476
297 577 2477
890 102 2478
262 467 2479
431 338 2480
277 454 2481
1128 341 2482
977 283 2483
109 513 2484
57 52 2485
103 663 2486
2246 654 2487
2487 278 2488
411 291 2489
972 108 2490
2249 1219 2491
88 277 2492
97 36 2493
123 36 2494
366 310 2495
114 1702 2496
847 529 2497
403 337 2498
427 118 2499
1908 487 2500
86 270 2501
382 423 2502
123 801 2503
352 1078 2504
952 267 2505
433 272 2506
951 744 2507
738 373 2508
1704 967 2509
297 271 2510
1383 318 2511
418 59 2512
322 368 2513
2513 1000 2514
799 152 2515
322 507 2516
381 337 2517
270 1071 2518
953 426 2519
264 374 2520
1152 999 2521
990 278 2522
1394 335 2523
1111 263 2524
119 280 2525
1199 550 2526
80 277 2527
980 547 2528
119 324 2529
106 292 2530
119 337 2531
270 307 2532
818 271 2533
942 1571 2534
49 1564 2535
2535 1051 2536
410 416 2537
2537 1514 2538
116 264 2539
1154 283 2540
123 362 2541
2279 268 2542
1201 293 2543
1079 735 2544
719 929 2545
702 1205 2546
353 954 2547
14 299 2548
125 455 2549
385 313 2550
2550 414 2551
568 36 2552
1034 1623 2553
2288 314 2554
812 306 2555
1110 864 2556
106 437 2557
87 87 2558
58 36 2559
283 497 2560
490 378 2561
640 53 2562
1594 317 2563
103 2292 2564
2564 265 2565
115 346 2566
38 276 2567
523 656 2568
263 709 2569
454 621 2570
262 290 2571
346 271 2572
1131 402 2573
2300 318 2574
276 72 2575
812 325 2576
302 1266 2577
480 271 2578
122 482 2579
2579 342 2580
754 398 2581
1467 278 2582
664 436 2583
2583 278 2584
668 304 2585
103 1234 2586
1661 485 2587
81 327 2588
122 293 2589
2115 363 2590
2590 319 2591
105 280 2592
69 2116 2593
1407 329 2594
412 544 2595
413 69 2596
2119 344 2597
506 1173 2598
119 1324 2599
352 476 2600
287 396 2601
395 1246 2602
1142 332 2603
1405 1647 2604
528 323 2605
379 291 2606
120 278 2607
276 666 2608
280 109 2609
721 283 2610
1731 2321 2611
424 277 2612
449 447 2613
1495 438 2614
365 113 2615
300 512 2616
118 327 2617
109 267 2618
982 268 2619
1961 262 2620
105 373 2621
313 121 2622
106 268 2623
2124 485 2624
120 269 2625
528 416 2626
103 2131 2627
2127 80 2628
2628 522 2629
2629 415 2630
304 103 2631
952 116 2632
324 265 2633
444 522 2634
2634 1310 2635
294 378 2636
812 357 2637
408 1483 2638
1105 109 2639
1497 331 2640
266 495 2641
88 614 2642
495 390 2643
1333 319 2644
369 102 2645
36 44 2646
89 87 2647
431 558 2648
2648 115 2649
491 2117 2650
2212 304 2651
1178 2348 2652
1477 107 2653
460 625 2654
1659 838 2655
2655 670 2656
2656 620 2657
2657 2352 2658
2658 1011 2659
2659 485 2660
2660 835 2661
2661 377 2662
2662 618 2663
595 501 2664
1723 403 2665
86 2112 2666
2666 890 2667
2667 278 2668
2668 2141 2669
1728 313 2670
87 1749 2671
951 278 2672
91 1194 2673
2673 2223 2674
73 104 2675
109 1338 2676
405 290 2677
554 294 2678
1737 52 2679
1342 2151 2680
2355 954 2681
735 276 2682
1987 438 2683
290 1193 2684
83 536 2685
347 2007 2686
2686 379 2687
1501 115 2688
447 303 2689
862 102 2690
1326 404 2691
2367 2162 2692
112 551 2693
82 1609 2694
424 655 2695
1739 881 2696
336 116 2697
1498 532 2698
482 107 2699
104 1160 2700
1503 956 2701
2701 300 2702
1216 603 2703
276 291 2704
1620 1413 2705
486 282 2706
294 105 2707
424 339 2708
359 325 2709
88 822 2710
693 1124 2711
321 111 2712
89 50 2713
1750 825 2714
120 375 2715
2001 102 2716
287 122 2717
515 2003 2718
14 389 2719
343 2006 2720
799 157 2721
2721 262 2722
319 278 2723
369 692 2724
84 416 2725
77 1273 2726
479 271 2727
1165 52 2728
1038 569 2729
102 459 2730
2394 268 2731
1131 578 2732
312 466 2733
1509 824 2734
368 290 2735
280 276 2736
615 322 2737
433 1768 2738
2738 414 2739
1640 376 2740
2181 452 2741
105 409 2742
415 1135 2743
351 339 2744
1771 282 2745
2184 486 2746
469 311 2747
116 570 2748
388 475 2749
347 1646 2750
484 113 2751
284 83 2752
276 379 2753
2415 300 2754
112 451 2755
263 1231 2756
77 118 2757
2757 537 2758
121 521 2759
313 1138 2760
2193 709 2761
107 1777 2762
84 685 2763
405 103 2764
44 475 2765
283 958 2766
2424 361 2767
1235 306 2768
1351 379 2769
847 341 2770
609 59 2771
2042 437 2772
714 297 2773
83 120 2774
1091 2428 2775
727 344 2776
71 126 2777
2777 105 2778
491 122 2779
2779 972 2780
1415 537 2781
466 271 2782
432 488 2783
111 703 2784
859 632 2785
509 296 2786
81 551 2787
2442 591 2788
292 260 2789
103 1445 2790
328 273 2791
471 281 2792
1539 1540 2793
706 2052 2794
2794 71 2795
61 52 2796
1090 331 2797
106 378 2798
74 277 2799
410 122 2800
311 291 2801
106 359 2802
123 656 2803
845 1877 2804
343 572 2805
2805 1289 2806
366 529 2807
1168 303 2808
1648 622 2809
437 282 2810
80 430 2811
2811 2218 2812
308 109 2813
1144 103 2814
846 933 2815
118 343 2816
888 271 2817
1059 1456 2818
1059 368 2819
1236 476 2820
115 268 2821
1457 297 2822
554 306 2823
112 824 2824
412 1249 2825
119 508 2826
50 95 2827
312 390 2828
2464 562 2829
347 378 2830
682 383 2831
14 740 2832
1889 1100 2833
2833 291 2834
830 394 2835
2835 279 2836
1097 306 2837
49 104 2838
394 430 2839
112 661 2840
107 260 2841
344 318 2842
72 328 2843
2843 1130 2844
276 1175 2845
812 263 2846
1251 283 2847
436 1095 2848
2239 627 2849
405 2478 2850
55 652 2851
426 2481 2852
1473 277 2853
59 276 2854
950 1028 2855
553 2248 2856
1658 2488 2857
1310 2490 2858
2858 437 2859
260 297 2860
693 865 2861
261 335 2862
101 108 2863
2254 1476 2864
2864 1456 2865
81 476 2866
2866 2256 2867
309 459 2868
108 277 2869
1429 589 2870
501 318 2871
374 1907 2872
1256 430 2873
108 540 2874
435 419 2875
485 260 2876
1663 513 2877
1567 1909 2878
825 276 2879
81 1482 2880
277 109 2881
112 298 2882
1744 419 2883
123 2084 2884
473 552 2885
610 1804 2886
1913 303 2887
93 280 2888
366 341 2889
509 306 2890
354 849 2891
858 400 2892
495 450 2893
1430 1132 2894
2070 348 2895
1392 112 2896
2896 496 2897
113 274 2898
260 391 2899
119 1347 2900
298 36 2901
36 300 2902
1367 2089 2903
115 422 2904
2521 467 2905
106 301 2906
102 455 2907
36 310 2908
2270 290 2909
272 125 2910
1015 283 2911
1922 2530 2912
459 271 2913
103 125 2914
312 120 2915
261 669 2916
264 1569 2917
76 90 2918
2918 71 2919
805 295 2920
1923 857 2921
116 485 2922
635 303 2923
304 575 2924
859 119 2925
2925 937 2926
1935 1590 2927
71 1107 2928
395 956 2929
296 637 2930
737 423 2931
107 499 2932
56 652 2933
1572 362 2934
416 338 2935
728 664 2936
1194 293 2937
106 476 2938
116 328 2939
122 270 2940
372 341 2941
88 115 2942
262 497 2943
80 2566 2944
70 703 2945
2945 2568 2946
303 282 2947
119 650 2948
122 302 2949
1475 271 2950
102 277 2951
119 1947 2952
543 268 2953
269 280 2954
113 324 2955
2955 596 2956
327 521 2957
564 114 2958
1719 268 2959
278 44 2960
71 505 2961
2961 412 2962
501 292 2963
287 104 2964
368 737 2965
106 588 2966
615 263 2967
2585 502 2968
604 649 2969
109 270 2970
543 260 2971
593 295 2972
56 276 2973
706 114 2974
319 104 2975
2310 271 2976
313 277 2977
2589 572 2978
570 2592 2979
103 1007 2980
306 459 2981
283 512 2982
1110 265 2983
1952 282 2984
310 332 2985
1712 105 2986
866 1953 2987
549 271 2988
408 1127 2989
1431 294 2990
2315 863 2991
563 496 2992
846 391 2993
397 310 2994
106 323 2995
1038 1598 2996
938 2121 2997
294 331 2998
1331 359 2999
2999 2601 3000
3000 93 3001
3001 2602 3002
290 1479 3003
116 323 3004
1956 362 3005
727 469 3006
629 1706 3007
76 1217 3008
1144 111 3009
878 688 3010
582 382 3011
2123 318 3012
262 379 3013
582 2614 3014
366 417 3015
86 2615 3016
277 104 3017
1226 282 3018
1235 1031 3019
2620 42 3020
3020 36 3021
3021 1960 3022
3022 120 3023
3023 1005 3024
736 273 3025
78 315 3026
370 414 3027
380 328 3028
83 116 3029
2332 291 3030
3030 71 3031
3031 2326 3032
1710 338 3033
2631 423 3034
104 373 3035
101 124 3036
274 2094 3037
3037 261 3038
114 2135 3039
1965 569 3040
102 109 3041
1144 423 3042
1553 1108 3043
519 360 3044
1695 2340 3045
292 872 3046
1207 529 3047
70 2241 3048
3048 74 3049
3049 2468 3050
3050 1108 3051
3051 2107 3052
1968 1205 3053
613 346 3054
1971 796 3055
565 938 3056
87 123 3057
91 272 3058
1046 2644 3059
88 279 3060
3060 79 3061
3061 969 3062
3062 1793 3063
3063 2145 3064
640 57 3065
1002 93 3066
3066 277 3067
2146 809 3068
523 2148 3069
1517 431 3070
1782 49 3071
118 982 3072
536 325 3073
2252 322 3074
3074 332 3075
963 114 3076
119 336 3077
433 327 3078
3078 2111 3079
107 2650 3080
101 1001 3081
300 106 3082
1747 833 3083
382 2349 3084
800 727 3085
2453 2652 3086
104 1428 3087
2664 260 3088
2669 295 3089
1950 364 3090
119 1157 3091
725 1190 3092
2275 404 3093
2318 282 3094
2182 367 3095
437 86 3096
567 278 3097
2152 273 3098
553 1983 3099
852 264 3100
1636 401 3101
115 1752 3102
400 262 3103
2153 1139 3104
3104 69 3105
3105 2643 3106
111 119 3107
354 558 3108
2147 448 3109
1409 1915 3110
1539 581 3111
2156 878 3112
2157 690 3113
2358 268 3114
120 339 3115
3115 503 3116
1331 312 3117
75 315 3118
71 115 3119
119 113 3120
2160 278 3121
1501 279 3122
416 274 3123
1733 2305 3124
113 1482 3125
84 75 3126
3126 91 3127
347 264 3128
375 542 3129
1302 2690 3130
658 1386 3131
2642 277 3132
347 303 3133
3133 693 3134
2693 578 3135
3135 1340 3136
659 261 3137
69 1609 3138
1202 311 3139
2696 87 3140
3140 1714 3141
110 584 3142
1722 1920 3143
1886 331 3144
336 291 3145
2091 316 3146
292 993 3147
3147 437 3148
71 2165 3149
849 355 3150
2373 690 3151
482 1246 3152
946 43 3153
38 76 3154
113 277 3155
71 1123 3156
122 318 3157
315 650 3158
2705 2706 3159
2379 277 3160
639 399 3161
74 1218 3162
3162 2709 3163
122 105 3164
1998 325 3165
578 358 3166
478 283 3167
335 71 3168
78 269 3169
260 397 3170
123 260 3171
265 325 3172
524 282 3173
1045 350 3174
1759 2720 3175
2381 416 3176
105 433 3177
76 2723 3178
119 14 3179
1221 503 3180
1047 487 3181
300 467 3182
629 111 3183
295 78 3184
262 411 3185
317 2014 3186
353 105 3187
3187 448 3188
301 312 3189
3189 486 3190
1762 455 3191
282 498 3192
2393 262 3193
312 276 3194
351 430 3195
408 120 3196
3196 318 3197
263 294 3198
300 531 3199
264 663 3200
355 893 3201
1764 304 3202
729 1638 3203
125 672 3204
82 36 3205
2713 2403 3206
54 60 3207
1012 376 3208
986 2027 3209
1052 1773 3210
1279 1012 3211
3211 621 3212
1347 116 3213
322 376 3214
2414 105 3215
418 609 3216
331 300 3217
276 459 3218
101 115 3219
300 2033 3220
328 2759 3221
2761 414 3222
2763 260 3223
1441 399 3224
69 102 3225
283 798 3226
112 283 3227
1443 271 3228
91 305 3229
106 395 3230
60 276 3231
2043 276 3232
2426 481 3233
3233 482 3234
107 272 3235
113 116 3236
1618 2430 3237
54 1060 3238
262 358 3239
2204 77 3240
2778 2436 3241
3241 2780 3242
3242 838 3243
2209 293 3244
402 2783 3245
1659 540 3246
3246 2785 3247
3247 113 3248
3248 701 3249
3249 392 3250
1791 1018 3251
3251 279 3252
3252 657 3253
3253 342 3254
3254 408 3255
3255 1019 3256
3256 762 3257
267 291 3258
119 675 3259
272 593 3260
375 556 3261
118 451 3262
2446 300 3263
1360 939 3264
300 387 3265
1022 392 3266
291 2797 3267
2798 265 3268
513 1657 3269
103 2053 3270
74 1361 3271
431 283 3272
106 352 3273
461 278 3274
1097 311 3275
2054 261 3276
3276 976 3277
3277 2054 3278
3278 317 3279
90 86 3280
3280 69 3281
102 730 3282
1096 1104 3283
1433 453 3284
1096 321 3285
262 726 3286
102 125 3287
1750 944 3288
82 594 3289
2812 1532 3290
1373 282 3291
280 959 3292
522 376 3293
694 1040 3294
74 112 3295
341 291 3296
424 392 3297
2060 974 3298
108 274 3299
1145 2457 3300
894 265 3301
276 125 3302
2461 688 3303
785 963 3304
103 2828 3305
3305 758 3306
3306 105 3307
3307 1121 3308
1457 946 3309
738 335 3310
296 121 3311
2834 112 3312
3312 2225 3313
3313 295 3314
3314 1140 3315
3315 814 3316
280 377 3317
427 270 3318
3318 408 3319
1134 123 3320
583 107 3321
266 455 3322
304 316 3323
506 121 3324
3324 374 3325
322 280 3326
104 276 3327
123 321 3328
529 674 3329
1308 1897 3330
106 1690 3331
123 294 3332
268 1087 3333
1693 1555 3334
1344 306 3335
2476 1028 3336
2838 995 3337
108 642 3338
1693 758 3339
571 114 3340
507 362 3341
119 342 3342
1470 1471 3343
108 261 3344
1125 2484 3345
350 282 3346
78 588 3347
424 272 3348
2079 1253 3349
1698 262 3350
1097 283 3351
1383 513 3352
2081 2491 3353
340 360 3354
102 470 3355
50 276 3356
119 551 3357
262 1164 3358
332 297 3359
118 291 3360
109 587 3361
421 704 3362
1476 368 3363
116 294 3364
381 1075 3365
109 124 3366
613 123 3367
532 397 3368
112 1173 3369
81 294 3370
461 681 3371
597 1355 3372
321 445 3373
418 52 3374
49 108 3375
356 596 3376
2253 373 3377
2506 383 3378
262 331 3379
295 103 3380
703 279 3381
3381 72 3382
101 451 3383
291 483 3384
2880 807 3385
1068 106 3386
706 419 3387
104 2245 3388
120 121 3389
417 1259 3390
952 464 3391
2512 52 3392
483 1706 3393
3393 539 3394
1259 2514 3395
114 430 3396
2890 2085 3397
408 116 3398
262 1094 3399
101 469 3400
49 933 3401
91 394 3402
2086 744 3403
2516 376 3404
2900 260 3405
1552 306 3406
1708 1198 3407
1759 817 3408
1152 313 3409
514 81 3410
2092 318 3411
304 455 3412
1035 419 3413
413 2905 3414
119 413 3415
119 1371 3416
88 118 3417
2267 268 3418
273 466 3419
270 1304 3420
125 687 3421
514 2269 3422
1474 2095 3423
76 1007 3424
865 106 3425
270 445 3426
14 69 3427
2909 2400 3428
722 268 3429
495 438 3430
958 794 3431
102 832 3432
408 337 3433
3433 321 3434
1431 113 3435
1372 36 3436
113 319 3437
3437 328 3438
416 572 3439
3439 547 3440
3440 303 3441
2103 1877 3442
2919 2536 3443
3443 1778 3444
3444 1442 3445
3445 74 3446
3446 458 3447
3447 2538 3448
3448 475 3449
2187 379 3450
3450 2920 3451
3451 2921 3452
3452 1713 3453
3453 1680 3454
1487 87 3455
109 521 3456
1924 283 3457
113 293 3458
3458 2924 3459
86 88 3460
405 1185 3461
283 1180 3462
119 115 3463
789 755 3464
1020 271 3465
860 740 3466
1203 14 3467
1186 1294 3468
2927 2545 3469
353 312 3470
945 296 3471
119 930 3472
119 298 3473
296 850 3474
1080 365 3475
2286 414 3476
102 2931 3477
1105 559 3478
298 1287 3479
340 785 3480
87 268 3481
434 1008 3482
3482 807 3483
120 737 3484
431 260 3485
1680 332 3486
76 642 3487
120 119 3488
294 1592 3489
71 663 3490
2936 278 3491
109 1136 3492
2501 265 3493
106 537 3494
104 290 3495
717 478 3496
87 1492 3497
125 395 3498
113 1215 3499
123 295 3500
582 118 3501
125 409 3502
2764 103 3503
121 280 3504
1493 850 3505
2569 470 3506
3506 445 3507
495 122 3508
107 270 3509
313 1795 3510
1326 260 3511
1389 1107 3512
808 58 3513
474 1495 3514
3514 532 3515
126 833 3516
292 1028 3517
2232 346 3518
1704 873 3519
290 893 3520
110 2958 3521
3521 280 3522
2574 84 3523
3523 361 3524
3524 891 3525
398 335 3526
831 295 3527
2093 348 3528
1949 265 3529
113 367 3530
297 88 3531
384 104 3532
3532 680 3533
1057 476 3534
101 266 3535
2051 1687 3536
3536 2962 3537
263 345 3538
123 317 3539
2844 2447 3540
2303 36 3541
431 294 3542
2580 831 3543
431 378 3544
3544 388 3545
108 416 3546
109 279 3547
457 1697 3548
116 1239 3549
1030 313 3550
1694 282 3551
271 102 3552
1163 262 3553
789 1686 3554
366 1264 3555
103 1327 3556
276 1709 3557
53 54 3558
2026 49 3559
2307 391 3560
3560 352 3561
3561 977 3562
3562 1556 3563
3563 352 3564
3564 1052 3565
3565 2587 3566
3566 831 3567
3567 2952 3568
3568 587 3569
3569 331 3570
3570 2308 3571
3571 2388 3572
3572 2396 3573
3573 445 3574
3574 421 3575
3575 2483 3576
3576 2092 3577
3577 970 3578
3578 604 3579
2173 291 3580
2588 79 3581
3581 2309 3582
836 936 3583
3583 2974 3584
3584 2975 3585
116 403 3586
3586 303 3587
1044 341 3588
2542 116 3589
270 572 3590
402 877 3591
265 335 3592
1523 278 3593
122 1770 3594
290 360 3595
598 277 3596
613 2077 3597
378 592 3598
463 448 3599
123 118 3600
2991 497 3601
589 549 3602
116 2600 3603
296 414 3604
562 2597 3605
2995 448 3606
986 490 3607
516 607 3608
2980 347 3609
1601 76 3610
3610 2997 3611
53 1093 3612
3004 1792 3613
3613 119 3614
103 600 3615
3007 268 3616
421 612 3617
1360 410 3618
3618 324 3619
283 1131 3620
507 1267 3621
3621 346 3622
3009 112 3623
3623 295 3624
54 53 3625
120 277 3626
431 360 3627
3627 318 3628
1248 311 3629
483 125 3630
826 104 3631
572 105 3632
1278 273 3633
114 1412 3634
951 344 3635
106 1480 3636
264 481 3637
50 50 3638
2978 1272 3639
295 2316 3640
3011 469 3641
307 79 3642
2612 120 3643
3643 49 3644
1166 890 3645
721 260 3646
309 38 3647
3017 1922 3648
113 323 3649
276 331 3650
1619 397 3651
363 313 3652
955 1953 3653
984 102 3654
79 269 3655
3655 125 3656
2622 322 3657
77 1337 3658
54 276 3659
321 393 3660
123 503 3661
322 311 3662
1084 503 3663
276 341 3664
1523 698 3665
3665 74 3666
3666 261 3667
3667 2625 3668
560 609 3669
2293 262 3670
2325 2387 3671
2421 1064 3672
1088 2327 3673
2333 313 3674
789 420 3675
1373 583 3676
280 466 3677
304 468 3678
44 418 3679
3679 60 3680
2633 1964 3681
3681 404 3682
1461 318 3683
758 1592 3684
120 302 3685
104 630 3686
1034 109 3687
120 541 3688
2637 340 3689
3038 692 3690
264 390 3691
319 265 3692
1276 306 3693
1700 264 3694
3694 118 3695
3695 425 3696
3696 1081 3697
3697 637 3698
3698 438 3699
38 2338 3700
3700 292 3701
3701 672 3702
366 1966 3703
2639 283 3704
2534 783 3705
1075 2251 3706
398 669 3707
1090 2075 3708
3708 282 3709
2341 277 3710
480 295 3711
41 2056 3712
1970 270 3713
1996 283 3714
2140 3053 3715
1241 480 3716
3054 570 3717
3717 319 3718
1075 114 3719
383 276 3720
2641 266 3721
370 1005 3722
292 1898 3723
84 121 3724
3724 265 3725
3725 300 3726
3726 1470 3727
3727 279 3728
1408 2289 3729
2143 354 3730
3730 976 3731
3731 2143 3732
3732 438 3733
104 1541 3734
75 279 3735
3735 87 3736
3736 874 3737
3067 423 3738
2210 2621 3739
125 303 3740
613 313 3741
466 291 3742
1082 341 3743
406 14 3744
120 306 3745
717 1290 3746
327 1327 3747
363 464 3748
107 874 3749
895 317 3750
352 291 3751
1020 38 3752
3071 36 3753
3072 400 3754
270 336 3755
348 116 3756
592 355 3757
2347 309 3758
1133 113 3759
3759 575 3760
3760 3084 3761
3085 119 3762
401 438 3763
1718 113 3764
3086 311 3765
2350 280 3766
2351 342 3767
3087 1976 3768
1913 265 3769
1976 306 3770
1302 1724 3771
106 375 3772
3772 630 3773
307 91 3774
2473 937 3775
3775 278 3776
3776 2671 3777
1978 1470 3778
3778 1243 3779
2575 3093 3780
75 2882 3781
3781 103 3782
3782 489 3783
2593 470 3784
2527 267 3785
74 290 3786
3786 442 3787
81 378 3788
1070 301 3789
727 2677 3790
2679 479 3791
1736 2188 3792
1980 313 3793
3793 390 3794
2680 437 3795
119 2681 3796
2130 503 3797
2852 1072 3798
276 82 3799
302 901 3800
76 365 3801
337 801 3802
1374 322 3803
3803 444 3804
821 388 3805
412 2875 3806
302 2233 3807
1030 2087 3808
506 324 3809
2134 449 3810
3810 3101 3811
72 87 3812
369 2356 3813
69 373 3814
410 965 3815
3815 118 3816
498 2258 3817
1147 312 3818
297 120 3819
81 125 3820
3820 269 3821
2390 85 3822
3822 101 3823
3823 378 3824
2359 283 3825
290 866 3826
108 316 3827
119 1635 3828
3116 1054 3829
1193 465 3830
808 56 3831
274 1231 3832
73 661 3833
2364 71 3834
2339 437 3835
1910 489 3836
3836 2549 3837
664 1903 3838
1916 553 3839
332 358 3840
1046 713 3841
613 278 3842
979 1290 3843
1486 838 3844
88 3129 3845
90 559 3846
3846 977 3847
3847 36 3848
295 475 3849
658 315 3850
3130 524 3851
317 3132 3852
351 627 3853
530 2692 3854
89 77 3855
3855 900 3856
3856 730 3857
3857 630 3858
114 342 3859
1610 1766 3860
2335 300 3861
640 1060 3862
3141 2368 3863
1739 2558 3864
2150 87 3865
3865 84 3866
585 707 3867
2369 1238 3868
417 1612 3869
1032 361 3870
3870 2113 3871
2065 278 3872
1234 388 3873
2895 744 3874
347 306 3875
120 324 3876
3876 449 3877
347 960 3878
310 297 3879
112 342 3880
428 1550 3881
76 3148 3882
512 1740 3883
1005 378 3884
836 122 3885
1410 581 3886
2371 262 3887
3153 2100 3888
740 740 3889
1337 339 3890
354 2703 3891
270 1995 3892
2708 283 3893
1415 293 3894
77 122 3895
3895 596 3896
3896 2710 3897
119 1749 3898
119 67 3899
118 332 3900
579 118 3901
355 410 3902
1751 837 3903
2377 311 3904
2716 283 3905
101 742 3906
87 323 3907
409 341 3908
121 486 3909
615 268 3910
565 294 3911
706 308 3912
118 279 3913
2004 1422 3914
707 306 3915
101 466 3916
2172 306 3917
74 101 3918
3180 306 3919
1128 310 3920
495 319 3921
53 2011 3922
332 1417 3923
1049 347 3924
1758 291 3925
309 282 3926
112 458 3927
103 269 3928
2375 1763 3929
264 433 3930
2179 291 3931
387 859 3932
302 369 3933
2022 1162 3934
1758 1515 3935
2026 104 3936
1764 118 3937
3937 592 3938
1343 107 3939
3939 347 3940
3940 268 3941
1624 341 3942
895 1643 3943
3943 1344 3944
861 271 3945
1167 271 3946
2743 344 3947
366 1434 3948
731 36 3949
1168 539 3950
2183 621 3951
110 323 3952
104 293 3953
412 897 3954
1435 498 3955
449 1172 3956
1520 1341 3957
3957 268 3958
3958 291 3959
112 306 3960
295 988 3961
473 77 3962
3213 274 3963
300 1279 3964
319 346 3965
2413 120 3966
402 103 3967
845 271 3968
2190 2032 3969
1136 2416 3970
88 3219 3971
3971 292 3972
3972 1137 3973
119 2417 3974
3221 2741 3975
474 897 3976
467 271 3977
1233 3217 3978
3223 2399 3979
490 465 3980
617 969 3981
3981 385 3982
88 261 3983
656 297 3984
525 104 3985
295 2422 3986
313 416 3987
3987 116 3988
1442 1637 3989
76 101 3990
280 101 3991
369 1009 3992
3992 414 3993
75 115 3994
3994 712 3995
2767 302 3996
269 714 3997
3230 1121 3998
1286 2772 3999
3999 1653 4000
402 1783 4001
3232 2200 4002
3234 304 4003
341 810 4004
120 316 4005
304 49 4006
345 404 4007
71 304 4008
4008 294 4009
87 491 4010
4010 1640 4011
431 268 4012
274 1121 4013
1528 362 4014
520 1620 4015
4015 1444 4016
1276 560 4017
72 811 4018
3240 77 4019
1047 265 4020
699 1061 4021
1293 1178 4022
4022 260 4023
300 2437 4024
272 1792 4025
4025 105 4026
1017 293 4027
2786 2048 4028
4028 509 4029
75 121 4030
90 292 4031
369 471 4032
2049 296 4033
343 116 4034
103 2443 4035
4035 296 4036
2051 2795 4037
4037 1541 4038
4038 593 4039
4039 3264 4040
4040 418 4041
1772 306 4042
274 304 4043
4043 574 4044
3269 1272 4045
728 279 4046
505 115 4047
4047 306 4048
276 717 4049
826 532 4050
636 57 4051
1096 309 4052
45 605 4053
1225 666 4054
284 14 4055
2449 362 4056
4056 1242 4057
4057 306 4058
4058 290 4059
4059 502 4060
4060 311 4061
4061 3281 4062
4062 1369 4063
4063 391 4064
4064 290 4065
4065 2450 4066
4066 306 4067
4067 2055 4068
4068 837 4069
4069 1101 4070
4070 3282 4071
4071 2803 4072
4072 653 4073
4073 2804 4074
1648 2056 4075
4075 2057 4076
310 810 4077
